import { QueryType } from "data-sweet-query";

export const INITIAL_CONTENT_STATE = {
    content: { type: QueryType.MYSQL },
};

export const INITIAL_CONTENT = `冬夜飲醉·學時應制
攬袂泛靈水︒褰裳望紫薇︒回車駕四野︒謝屐倚崔嵬︒崖殘映月冷︒天高盡雁飛︒長風起華鬢︒霜冷凍蛾眉︒舉手天星遠︒俯身擷芳菲︒兩盞三月飲︒一壺轉清輝︒影亂且狂舞︒癲歌任冠危︒濕吾素青衫︒長餘陸離佩︒留月懶鞠水︒戀酒毋貪杯︒喪志豈非福︒弃輯安可悲︒援琴發清商︒音響吟式微︒忽憤紫冥頂︒白鹿安且在︒指劍西南隅︒天狼光已微︒初陽日漸遠︒斗柄夜逐回︒朝華既已披︒夕秀未可振︒依稀謝前世︒飄然忘今歸︒
  夏望·歎
蹙眉空坐冤疑鏡老容顏陰蘩固燦色陽景逐虛煙熏風總浮雀灼天遍落雲惟恨紅塵陌往來無聚年︒
  劍仙·其三
何故苦蹙眉︒似有不平事︒明朝逐雲去︒一劍撫三山︒
  劍仙·其二
吾意本清貧︒竟志褰劍裝︒三夫天下指︒魍魎盡聵盲︒弄玉馮昆吾︒汲波踏沅湘︒露凝雙鬢濕︒雲流若水長︒終倚崔巍去︒萬裏不同疆︒若非戾念深︒或可宿桃鄉︒
  劍仙·其一
千川劍惟流︒萬岳吾獨宗︒馮夷浣仙舄︒遺世逸華嵩︒
  無題·生涯
須臾末世徒幽望︒咫尺天涯惘斷腸︒頻倚劍峰期月水︒默吟殘賦淚星芒︒
  無題·道癲
獨對寒燈思徒矣︒褰裳一笑竟他年︒雕闌遍倚望雲老︒畫船空臥聽雨眠︒三潭弱水幾多月︒一頃西湖無限天︒殄盡金樽拼一醉︒奈由術序任誰仙︒
  北念友人
紫艶香殘日愈秋︒紅箋淚盡字成愁︒憑欄一望空江水︒徒赴孤帆苦北流︒
  無題·傷雲期
雁字回時凄南浦︒小霰分杯欲飲無︒雲期隨謝花零走︒淡看飛煙馮凜湖︒
  夜泛秋湖
秋旻多落雲︒平野將霧升︒漫花零入夜︒纖月散成紋︒小舟亂一頃︒弱酒醉三生︒何當枕來路︒釋數霜發增︒
  夕雪
玄凜幽風起︒霾靄逝天光︒霫霫入瀝泣︒雲霨見神煌︒霡霂紛然落︒霜露寒內傷︒氤氳窮冥暮︒霙作雨仿徨︒
  無題·塵緣
天晚楊糝忽作雪︒下渚輕舟逐水煙︒無花無酒春將老︒劍死琴銷了塵緣︒`;
