import React from "react";

import { createStyles, Theme, WithStyles, withStyles } from "@material-ui/core";

const styles = (_theme: Theme) =>
    createStyles({
        content: {
            fontSize: "2rem",
            height: "20em",
            lineHeight: "2rem",
            overflowX: "auto",
            textAlign: "start",
            textOrientation: "upright",
            whiteSpace: "pre-wrap",
            width: "100%",
            writingMode: "vertical-rl",

            "&::-webkit-scrollbar": {
                display: "none",
                width: "0.25rem",
                height: "0.25rem",
            },
            "&:hover::-webkit-scrollbar": {
                display: "block",
            }
        },
    });

interface Props extends WithStyles<typeof styles> {
    contentBody: string;
    fetchContent: () => void;
}

class Content extends React.Component<Props> {
    componentDidMount() {
        this.props.fetchContent();
    }

    render() {
        const { classes } = this.props;
        console.log(this.props.contentBody);

        const contentBody =
            this.props.contentBody ||
            `  夕雪
玄凜幽風起 霾靄逝天光
霫霫入瀝泣 雲霨見神煌
霡霂紛然落 霜露寒內傷
氤氳窮冥暮 霙作雨仿徨
  無題·塵緣
天晚楊糝忽作雪
下渚輕舟逐水煙
無花無酒春將老
劍死琴銷了塵緣
  火宵之月
火煙隨銷淼
離宵淚月纖
千光逝流年
幻水夢穎天
紫冥何惘惘
紛香徒芊芊
殘雪拚飛盡
漏署俟霞翩
  醒夜占星
四侐倚孤松
燭淚影重重
撫弦雲倏渰
散發夜始空
獨立歎風晚
躇行瞲草新
徒然數氳暮
惔星泣紫穹
  臨餐
仿徨望香起
躑躅舉觴杯
零目落山珍
飄搖見海味
亂箸指天罡
棄盞嗔錢貴
穿腸雖酒肉
人間有真味
  古風·憶荊軻
盡日下汶水
狂歌上岱宗
拂劍分光曄
泣舄望雲重
忽聞易水歌
獵獵有風棲
蕭蕭去不返
淬匕擊庭銅
炎星亂史天
何苦歎名窮
浩蕩南征去
萬裏義如風
  讀書
撫紙覺風悲
彈燈憶花淚
風雪一頁過
黯然解誰味
  古風·拜星月
挽鬢留風冷
持樽拜星月
亂步棄紫金
倒冠望神闕
長嘯散雲壑
惶惶見光曄
人世當寂寞
朝花夕多謝
幾日乘黃鶴
馮虛奔仙界
茫茫冥窮暮
吾星光如瀉
  古風·春末
伏幾忽忘性
春末看花飛
騁意放四海
終倚上崔巍
山木有蕭瑟
連風至海內
棄屐無餘羈
安桀反來路
來世未可度
去往皆焚灰
願逝蓬萊去
萬里不復歸
  古風·西溪
移舟西塘上
日影泛水深
翩翩夢遠跡
幽幽忘故城
汀上動蘭芷
沙裏漾菱荇
馳目黃芳燦
花期不可期
日來桃源渺
遇此複忘情
垂身風溪上
寥寥釣無心
  古風·遊夜
倚月望天宮
光移花亂影
攬風忘袂冷
憑雲到北坡
長步看新草
小坐數寒星
撫發知涼夜
懶起照水鏡
華燈應已遠
近野無村人
忽聞幽谷凜
無心啟寒琴
去日當已矣
來世未可知
且扣玉郎簿
朝起夢太清
  詠柏
瑟瑟一叢柏
零落幾何枝
亂葉向天動
繁根撫密石
冷月曾相凜
炙日又將灼
冉冉未敢逝
風起笑夢癡

  邀月
春來樽前常俟月
幕簾半卷碧雲斜
白日靄霧遠春去
黃昏烟火近人家
平林歸鳥啼寂寞
淺水游魚息平暇
舉酒欲飲邀姮娥
可憐蟾宮無春花
  憶君影
君憶花間酒
年來是分離
對鏡歎風老
提簪忘發稀
昔觴光常滿
今箸難為食
春來萬將苒
參商會有期
  春望
盡日恨冬雪
春來路忽迷
野草沒失徑
幽花隱繁蔭
灞橋懶折柳
長亭倦送雲
倚門忘世意
千里烟川平
  清嘯
年來野徑蹤難覓
獨立高崖袖滿風
撫劍鳴琴聽秋水
彈燈譜奕落春榮
憑窗滅意千山遠
倚榻泯情萬雲平
且赴花間一壺酒
長嘯廣寄送青空
  冰煌雪舞
夢回啓寒窗 曳影獨幢幢
冷蕭瑟懷骨 悲憐憫冬霜
雪舞浮光起 冰煌楚天長
倉皇忘世凜 長嗟夜未央

  春雲
閑閑碧空上
車馬何去來
分光斂真跡
風散棄形骸
俯望春山好
仰首見露臺
今夕眄四海
明朝送雨來
  百花谷
空山已寂人未跡
落英無情天有晴
亂步芳菲懶回顧
風聲起處忽聞君
  飄塵
坐忘湖邊好
來去恨陽斜
散穀待群鳥
垂針戲魚蝦
山青雲不雨
水碧風無暇
天光午後懶
林氣日夕佳
靜倚柴門老
留翠煮名茶
把盞代清酒
歸醉共繁花
  無題·打油
長風倏起九天寒
門外樓頭人初散
把酒邀天天不應
棄盞踟躇影零亂
狂雲盡掠月蒼冷
舉手摘星明還暗
蒿草斜沉芳菲過
一任嵐討湖東畔
  冬夜飲醉·學時應制
攬袂泛靈水，褰裳望紫薇
回車駕四野，謝屐倚崔嵬
崖殘映月冷，天高盡雁飛
長風起華鬢，霜冷凍蛾眉
舉手天星遠，俯身擷芳菲
兩盞三月飲，一壺轉清輝
影亂且狂舞，癲歌任冠危
濕吾素青衫，長餘陸離佩
留月懶鞠水，戀酒毋貪杯
喪志豈非福，弃輯安可悲？
援琴發清商，音響吟『式微』
忽憤紫冥頂，白鹿安且在！
指劍西南隅，天狼光已微
初陽日漸遠，斗柄夜逐回
朝華既已披，夕秀未可振？
依稀謝前世，飄然忘今歸
  桃花溪
風卷殘簫落英飛
泛盡青溪折又回
斜陽微透暮煙重
醉掩清愁不需歸
  思君二首·其一
寂寂人初定
落葉滿秋原
霜繁暮山泣
月惘夜雲翩
舊箋傷心語
新裳斷腸褰
青光十二轉
離散又一年
  思君二首·其二
疏雲漏殘光
低江有亂航
倚樓幻風雨
憑闌作參商
青燈彈且落
寒琴抹複傷
年年但鵲夜
向箋費泪行
  宴寂
盡宴將何往
若影逝蹁躚
漸字成淒冷
逐夜轉纏綿
思遍璃泪結
恨極青絲雪
煢煢西南立
送雲徒遠遷
  夜泛秋湖
秋旻多落雲
平野將霧升
漫花零入夜
纖月散成紋
小舟亂一頃
弱酒醉三生
何當枕來路
釋數霜發增
  無題·傷雲期
雁字回時凄南浦
小霰分杯欲飲無
雲期隨謝花零走
淡看飛煙馮凜湖
  北念友人
紫艶香殘日愈秋
紅箋淚盡字逐愁
憑欄一望空恨水
徒赴孤帆苦北流
  亂彈
他年松下獨醉去 
現世忽如此局殘 
仰吹五嶽流雲散 
俯逐三江凜水湍 
欲摘明月秋未中 
方濟滄海興複闌 
何日殿前奏君上 
請為冊與遊仙官
  夏望·歎
蹙眉空坐冤 
疑鏡老容顏 
陰蘩固燦色 
陽景逐虛煙 
熏風總浮雀 
灼天遍落雲 
惟恨紅塵陌 
往來無聚年`;

        return <div className={classes.content}>{contentBody}</div>;
    }
}

export default withStyles(styles)(Content);
